from sqlite3 import connect
from sys import argv


def fill(db: str, insert_query: str, data: list) -> None:
    with connect(db) as connection:
        cursor = connection.cursor()
        cursor.executemany(insert_query, data)
        connection.commit()


if __name__ == '__main__':

    if len(argv) != 0 and argv[0] == 'coach':
        inser_coaches = "INSERT INTO 'main_coach' (image, caption, education, achievements, is_published) VALUES (?, ?, ?, ?, ?);"
        coaches_data = [
            ('coach/ruslan.png', 'Персональний тренер', 'СумДУ, медичний інститут, факультет фізичної терапії, ерготерапії та спортивної медицини', '4-кратна золота та 3-кратно срiбна призерка з чемпіонату з сучасних танців. 3-кратна золота та 2-кратна призерка з легкої атлетики на чемпіонаті україни. тренерський стаж 2 роки', True),
            ('coach/yarina.png', 'Тренер зі стрейчингу та pole dance ', 'СумДУ, медичний інститут, факультет фізичної терапії, ерготерапії та спортивної медицини', '4-кратна золота та 3-кратно срiбна призерка з чемпіонату з сучасних танців. 3-кратна золота та 2-кратна призерка з легкої атлетики на чемпіонаті україни. тренерський стаж 2 роки', True),
            ('coach/tonay.png', 'Персональний тренер та тренер з фітнес-міксу', 'СумДУ, медичний інститут, факультет фізичної терапії, ерготерапії та спортивної медицини', '4-кратна золота та 3-кратно срiбна призерка з чемпіонату з сучасних танців. 3-кратна золота та 2-кратна призерка з легкої атлетики на чемпіонаті україни. тренерський стаж 2 роки', True),
            ('coach/katya.png', 'Тренер 3 лфк, дитячого фітнесу та сучасних танців', 'СумДУ, медичний інститут, факультет фізичної терапії, ерготерапії та спортивної медицини', '4-кратна золота та 3-кратно срiбна призерка з чемпіонату з сучасних танців. 3-кратна золота та 2-кратна призерка з легкої атлетики на чемпіонаті україни. тренерський стаж 2 роки', True),
            ('coach/katya.png', 'Тренер 3 лфк, дитячого фітнесу та сучасних танців (1)', 'СумДУ, медичний інститут, факультет фізичної терапії, ерготерапії та спортивної медицини', '4-кратна золота та 3-кратно срiбна призерка з чемпіонату з сучасних танців. 3-кратна золота та 2-кратна призерка з легкої атлетики на чемпіонаті україни. тренерський стаж 2 роки', True),
            ('coach/katya.png', 'Тренер 3 лфк, дитячого фітнесу та сучасних танців (2)', 'СумДУ, медичний інститут, факультет фізичної терапії, ерготерапії та спортивної медицини', '4-кратна золота та 3-кратно срiбна призерка з чемпіонату з сучасних танців. 3-кратна золота та 2-кратна призерка з легкої атлетики на чемпіонаті україни. тренерський стаж 2 роки', True),
            ('coach/katya.png', 'Тренер 3 лфк, дитячого фітнесу та сучасних танців (3)', 'СумДУ, медичний інститут, факультет фізичної терапії, ерготерапії та спортивної медицини', '4-кратна золота та 3-кратно срiбна призерка з чемпіонату з сучасних танців. 3-кратна золота та 2-кратна призерка з легкої атлетики на чемпіонаті україни. тренерський стаж 2 роки', True),
        ]
        fill('website.db', inser_coaches, coaches_data)
    elif len(argv) != 0 and argv[0] == 'direction':
        inser_directions = "INSERT INTO 'main_direction' (image, name, description, is_published) VALUES (?, ?, ?, ?);"
        directions_data = [
            ('direction/gym.png', 'Тренажерна зала', 'Без опису', True),
            ('direction/trx.png', 'trx', 'Без опису', True),
            ('direction/stretch.png', 'Стречінг', 'Без опису', True),
            ('direction/poledance.png', 'poledance', 'Без опису', True),
            ('direction/pilates.png', 'Пілатес', 'Без опису', True),
            ('direction/cardio.png', 'Кардіозона', 'Без опису', True),
            ('direction/kidsfitness.png', 'Дитячий фітнес', 'Без опису', True),
            ('direction/sportnutrition.png', 'Спортивне харчування', 'Без опису', True),
            ('direction/sportswear.png', 'Спортивний одяг', 'Без опису', True),
        ]
        fill('website.db', inser_directions, directions_data)
    else:
        print('Nothing')
